Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# 正文
source: Manuscript
ja: 本文
ko: 본문
ru: Основной текст
zh_hans: 正文
zh_hant: 正文

# 正文、剧情状态和相关资料会一起回到上一个存档点，不会删除历史记录。
source: The manuscript, plot state, and related materials will all return to the previous checkpoint. History won't be deleted.
ja: 本文、ストーリー状態、関連資料を直前の保存ポイントに戻します。履歴は削除されません。
ko: 본문, 줄거리 상태 및 관련 자료를 이전 저장 지점으로 함께 되돌리며, 기록은 삭제하지 않습니다.
ru: Текст, состояние сюжета и связанные материалы вернутся к предыдущей точке сохранения; история не удаляется.
zh_hans: 正文、剧情状态和相关资料会一起回到上一个存档点，不会删除历史记录。
zh_hant: 正文、劇情狀態和相關資料會一起回到上一個存檔點，不會刪除歷史記錄。

# 正文中的“%@”对应哪位角色？确认后，已有经历会自动归入同一人物。
source: Which character does “%@” refer to in the manuscript? After you confirm, existing experiences will be automatically assigned to the same person.
ja: 本文中の「%@」はどのキャラクターですか？確認すると、既存の出来事が自動的に同じ人物にまとめられます。
ko: 본문의 “%@”은(는) 어느 캐릭터인가요? 확인하면 기존 경험이 같은 인물로 자동 분류됩니다.
ru: Какому персонажу соответствует «%@» в тексте? После подтверждения существующие события будут автоматически отнесены к тому же персонажу.
zh_hans: 正文中的“%@”对应哪位角色？确认后，已有经历会自动归入同一人物。
zh_hant: 正文中的「%@」對應哪位角色？確認後，既有經歷會自動歸入同一人物。

# 正文候选 · 收录后才进入正式剧情
source: Manuscript candidate · added to the official story after adoption
ja: 本文候補 · 収録後に正式なストーリーに追加
ko: 본문 후보 · 수록 후에만 정식 스토리에 들어감
ru: Кандидат основного текста · войдёт в официальный сюжет после добавления
zh_hans: 正文候选 · 收录后才进入正式剧情
zh_hant: 正文候選 · 收錄後才進入正式劇情

# 正文在这次扫描之后又改过了，结果可能已经过期。
source: The manuscript was edited after this scan, so the result may be out of date.
ja: スキャン後に本文が変更されています。結果が古くなっている可能性があります。
ko: 이번 스캔 후 본문이 다시 변경되어 결과가 최신이 아닐 수 있습니다.
ru: Текст изменился после этой проверки, поэтому результат может быть устаревшим.
zh_hans: 正文在这次扫描之后又改过了，结果可能已经过期。
zh_hant: 正文在這次掃描後又被修改，結果可能已經過期。

# 正文已安全保留
source: Manuscript safely preserved
ja: 本文は安全に保持されています
ko: 본문을 안전하게 보관했습니다
ru: Текст надёжно сохранён
zh_hans: 正文已安全保留
zh_hant: 正文已安全保留

# 正文已进书。可选把本章已确认的讨论整理成长期记忆，先给你确认再写入。
source: The manuscript has been added to the book. You can optionally organize this chapter's confirmed discussion into long-term memory; you'll review it before it's written.
ja: 本文は書籍に収録されました。この章で確認済みの議論を長期メモリに整理することもできます。先に確認してもらってから書き込みます。
ko: 본문이 책에 수록되었습니다. 이번 장에서 확인한 논의를 장기 기억으로 정리할 수 있으며, 먼저 확인을 받은 후 저장합니다.
ru: Основной текст добавлен в книгу. При желании подтверждённые обсуждения этой главы можно оформить как долговременную память: сначала вы проверите их, затем они будут записаны.
zh_hans: 正文已进书。可选把本章已确认的讨论整理成长期记忆，先给你确认再写入。
zh_hant: 正文已收錄至書稿。可選擇將本章已確認的討論整理成長期記憶，先讓你確認後再寫入。

# 正文收录
source: Add to manuscript
ja: 本文を収録
ko: 본문 수록
ru: Добавление основного текста
zh_hans: 正文收录
zh_hant: 正文收錄

# 正文收录后
source: After manuscript adoption
ja: 本文収録後
ko: 본문 수록 후
ru: После добавления основного текста
zh_hans: 正文收录后
zh_hant: 正文收錄後

# 正文润色后
source: After manuscript polish
ja: 本文推敲後
ko: 본문 다듬기 후
ru: После редактуры основного текста
zh_hans: 正文润色后
zh_hant: 正文潤色後

# 正文片段 · 收录后进入本章
source: Manuscript excerpt · added to this chapter after adoption
ja: 本文の断片 · 収録後にこの章へ追加
ko: 본문 조각 · 수록 후 이 장에 추가
ru: Фрагмент основного текста · после добавления войдёт в эту главу
zh_hans: 正文片段 · 收录后进入本章
zh_hant: 正文片段 · 收錄後進入本章

# 此会话由父线程编排，暂不支持直接输入
source: This conversation is orchestrated by a parent thread and doesn't support direct input yet
ja: このセッションは親スレッドが管理しているため、直接入力には対応していません
ko: 이 세션은 상위 스레드가 조정하므로 직접 입력을 지원하지 않습니다.
ru: Сеанс управляется родительским потоком; прямой ввод пока не поддерживается
zh_hans: 此会话由父线程编排，暂不支持直接输入
zh_hant: 此會話由父執行緒編排，目前不支援直接輸入

# 此操作不可撤销，会话内的全部消息将被删除。
source: This action can't be undone. All messages in the session will be deleted.
ja: この操作は取り消せません。会話内のすべてのメッセージが削除されます。
ko: 이 작업은 되돌릴 수 없으며, 세션의 모든 메시지가 삭제됩니다.
ru: Это действие нельзя отменить: все сообщения сеанса будут удалены.
zh_hans: 此操作不可撤销，会话内的全部消息将被删除。
zh_hant: 此操作無法復原，對話中的全部訊息將被刪除。

# 步骤
source: Steps
ja: 手順
ko: 단계
ru: Шаг
zh_hans: 步骤
zh_hant: 步驟

# 步骤 %@
source: Step %@
ja: ステップ %@
ko: 단계 %@
ru: Шаг %@
zh_hans: 步骤 %@
zh_hant: 步驟 %@

# 步骤列表（%lld 步）
source: Step list (%lld steps)
ja: 手順一覧（%lldステップ）
ko: 단계 목록(%lld단계)
ru: Список шагов (%lld)
zh_hans: 步骤列表（%lld 步）
zh_hant: 步驟列表（%lld 步）

# 每次搜索最多返回的结果条数
source: Maximum results returned per search
ja: 1回の検索で返す結果の上限
ko: 검색당 최대 결과 수
ru: Максимальное число результатов за один поиск
zh_hans: 每次搜索最多返回的结果条数
zh_hant: 每次搜尋最多回傳的結果數量

# 每章收录前都会检查连续性硬伤
source: Major continuity errors are checked before each chapter is adopted
ja: 各章の収録前に重大な整合性問題を確認します
ko: 각 장을 수록하기 전에 심각한 연속성 오류를 확인합니다
ru: Перед добавлением каждой главы проверяются критические ошибки непрерывности.
zh_hans: 每章收录前都会检查连续性硬伤
zh_hant: 每章收錄前都會檢查連續性硬傷

# 没有%@资料
source: No %@ materials
ja: 「%@」の資料はありません
ko: %@ 자료 없음
ru: Нет материалов для %@
zh_hans: 没有%@资料
zh_hant: 沒有%@資料

# 没有匹配的会话
source: No matching conversations
ja: 一致する会話はありません
ko: 일치하는 대화가 없습니다
ru: Совпадающих чатов нет
zh_hans: 没有匹配的会话
zh_hant: 沒有符合的對話

# 没有发现前后打架的地方。
source: No inconsistencies found.
ja: 前後で食い違う箇所は見つかりませんでした。
ko: 앞뒤가 충돌하는 부분을 찾지 못했습니다.
ru: Противоречий не обнаружено.
zh_hans: 没有发现前后打架的地方。
zh_hant: 沒有發現前後衝突的地方。

# 没有可用的聊天服务商和模型，无法生成模板草稿。
source: No chat providers or models are available, so a template draft cannot be generated.
ja: 利用可能なチャットプロバイダーとモデルがないため、テンプレートの下書きを生成できません。
ko: 사용 가능한 채팅 제공업체와 모델이 없어 템플릿 초안을 생성할 수 없습니다.
ru: Нет доступных провайдеров и моделей чата; создать черновик шаблона нельзя.
zh_hans: 没有可用的聊天服务商和模型，无法生成模板草稿。
zh_hant: 沒有可用的聊天服務提供者和模型，無法產生範本草稿。

# 没有可移除的席位配置
source: No seat configurations to remove
ja: 削除できる議席設定はありません
ko: 제거할 의석 설정이 없습니다
ru: Нет конфигураций мест для удаления
zh_hans: 没有可移除的席位配置
zh_hant: 沒有可移除的席位設定

# 没有可读取的聊天模型，生成时会回退当前聊天模型或本地草稿。
source: No readable chat model is available, so generation will fall back to the current chat model or a local draft.
ja: 利用可能なチャットモデルがないため、生成時は現在のチャットモデルまたはローカルの下書きを使用します。
ko: 읽을 수 있는 채팅 모델이 없어 생성 시 현재 채팅 모델 또는 로컬 초안으로 대체됩니다.
ru: Нет доступных моделей чата; при создании будет использована текущая модель чата или локальный черновик.
zh_hans: 没有可读取的聊天模型，生成时会回退当前聊天模型或本地草稿。
zh_hant: 沒有可讀取的聊天模型，產生時會改用目前的聊天模型或本機草稿。

source: No iOS-supported trending sources are enabled. Go to Settings to choose Hacker News, arXiv AI, InfoQ AI, 36Kr, HF Papers, or GitHub AI.
ja: iOS対応のトレンドソースが有効になっていません。設定で Hacker News、arXiv AI、InfoQ AI、36Kr、HF Papers、GitHub AI のいずれかを選択してください。
ko: iOS에서 지원되는 인기 순위 출처가 활성화되어 있지 않습니다. 설정에서 Hacker News, arXiv AI, InfoQ AI, 36Kr, HF Papers 또는 GitHub AI를 선택하세요.
ru: Не включён ни один источник трендов, поддерживаемый iOS. Выберите в настройках Hacker News, arXiv AI, InfoQ AI, 36Kr, HF Papers или GitHub AI.
zh_hans: 没有启用任何 iOS 支持的热榜来源。请到设置里选择 Hacker News、arXiv AI、InfoQ AI、36Kr、HF Papers 或 GitHub AI。
zh_hant: 沒有啟用任何 iOS 支援的熱門榜單來源。請前往設定選取 Hacker News、arXiv AI、InfoQ AI、36Kr、HF Papers 或 GitHub AI。

# 没有待继续任务
source: No resumable task
ja: 続行待ちのタスクはありません
ko: 계속할 작업이 없습니다.
ru: Нет задач для продолжения
zh_hans: 没有待继续任务
zh_hant: 沒有待繼續任務

# 没有权限执行此操作。
source: You don't have permission to do this.
ja: この操作を実行する権限がありません。
ko: 이 작업을 실행할 권한이 없습니다.
ru: Нет разрешения на это действие.
zh_hans: 没有权限执行此操作。
zh_hant: 沒有權限執行此操作。

# 没有结果
source: No results
ja: 結果はありません
ko: 결과 없음
ru: Нет результатов
zh_hans: 没有结果
zh_hant: 沒有結果

# 没有进行中的任务
source: No task in progress
ja: 進行中のタスクはありません
ko: 진행 중인 작업이 없습니다.
ru: Нет выполняющихся задач
zh_hans: 没有进行中的任务
zh_hant: 沒有進行中的任務

# 没有选择文件。
source: No file selected.
ja: ファイルが選択されていません。
ko: 선택한 파일이 없습니다.
ru: Файл не выбран.
zh_hans: 没有选择文件。
zh_hant: 沒有選擇檔案。

# 注入与 Lorebook
source: Injection & Lorebook
ja: 注入と Lorebook
ko: 주입 및 Lorebook
ru: Внедрение и Lorebook
zh_hans: 注入与 Lorebook
zh_hant: 注入與 Lorebook

# 注入内容
source: Injection content
ja: 注入コンテンツ
ko: 주입 내용
ru: Содержимое внедрения
zh_hans: 注入内容
zh_hant: 注入內容

# 注入规则预览
source: Injection rule preview
ja: 注入ルールのプレビュー
ko: 주입 규칙 미리보기
ru: Предпросмотр правил внедрения
zh_hans: 注入规则预览
zh_hant: 注入規則預覽

# 活动状态
source: Activity status
ja: アクティビティ状態
ko: 활동 상태
ru: Состояние активности
zh_hans: 活动状态
zh_hant: 活動狀態

# 浅色
source: Light
ja: ライト
ko: 라이트
ru: Светлая
zh_hans: 浅色
zh_hant: 淺色

# 测试当前议会模型
source: Test current council model
ja: 現在の議会モデルをテスト
ko: 현재 의회 모델 테스트
ru: Проверить текущую модель совета
zh_hans: 测试当前议会模型
zh_hant: 測試目前議會模型

# 浏览任务
source: Browse tasks
ja: タスクを表示
ko: 작업 찾아보기
ru: Задачи браузера
zh_hans: 浏览任务
zh_hant: 瀏覽任務

# 浏览器
source: Browser
ja: ブラウザ
ko: 브라우저
ru: Браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# 消息
source: Messages
ja: メッセージ
ko: 메시지
ru: Сообщения
zh_hans: 消息
zh_hant: 訊息

# 消息显示
source: Message display
ja: メッセージ表示
ko: 메시지 표시
ru: Отображение сообщений
zh_hans: 消息显示
zh_hant: 訊息顯示

# 润修中%@
source: Revising%@
ja: 推敲中%@
ko: 다듬기 중%@
ru: Редактирование%@
zh_hans: 润修中%@
zh_hant: 潤修中%@

# 润修要求
source: Polish requirements
ja: 推敲の要件
ko: 다듬기 요구사항
ru: Требования к правке
zh_hans: 润修要求
zh_hant: 潤修要求

# 润色候选已过期
source: Polish candidate expired
ja: 推敲候補の期限切れ
ko: 윤문 후보가 만료되었습니다
ru: Кандидат правки устарел
zh_hans: 润色候选已过期
zh_hant: 潤飾候選已過期

# 润色偏好
source: Polish preferences
ja: 推敲の設定
ko: 다듬기 선호 설정
ru: Предпочтения редактуры
zh_hans: 润色偏好
zh_hant: 潤色偏好

# 润色完成
source: Polish complete
ja: 推敲完了
ko: 윤문 완료
ru: Правка завершена
zh_hans: 润色完成
zh_hant: 潤飾完成

# 润色没有开始，请稍后重试。
source: Polishing didn't start. Please try again later.
ja: 推敲を開始できませんでした。後でもう一度お試しください。
ko: 다듬기를 시작하지 못했습니다. 나중에 다시 시도하세요.
ru: Редактура не началась. Повторите позже.
zh_hans: 润色没有开始，请稍后重试。
zh_hant: 潤色沒有開始，請稍後重試。

# 润色版已采用
source: Polished version adopted
ja: 推敲版を採用済み
ko: 윤문본이 채택되었습니다
ru: Вариант правки принят
zh_hans: 润色版已采用
zh_hant: 潤飾版已採用

# 润色生成已中断
source: Polish generation interrupted
ja: 推敲の生成が中断されました
ko: 윤문 생성이 중단되었습니다
ru: Генерация правки прервана
zh_hans: 润色生成已中断
zh_hant: 潤飾產生已中斷

# 深度分析
source: Deep analysis
ja: 詳細分析
ko: 심층 분석
ru: Глубокий анализ
zh_hans: 深度分析
zh_hant: 深入分析

# 深度阅读
source: Deep reading
ja: 精読
ko: 심층 읽기
ru: Глубокое чтение
zh_hans: 深度阅读
zh_hant: 深度閱讀

# 深度阅读历史
source: Deep reading history
ja: 精読の履歴
ko: 심층 읽기 기록
ru: История глубокого чтения
zh_hans: 深度阅读历史
zh_hant: 深度閱讀歷史

# 深度阅读模型
source: Deep Reading Model
ja: ディープリーディングモデル
ko: 심층 읽기 모델
ru: Модель глубокого чтения
zh_hans: 深度阅读模型
zh_hant: 深度閱讀模型

# 深度阅读生成失败：%@
source: Deep-reading generation failed: %@
ja: 詳細リサーチの生成に失敗しました：%@
ko: 심층 읽기 생성 실패: %@
ru: Не удалось создать результат глубокого чтения: %@
zh_hans: 深度阅读生成失败：%@
zh_hant: 深度閱讀產生失敗：%@

# 深度阅读设置
source: Deep reading settings
ja: 精読設定
ko: 심층 읽기 설정
ru: Настройки глубокого чтения
zh_hans: 深度阅读设置
zh_hant: 深度閱讀設定

# 深色
source: Dark
ja: ダーク
ko: 다크
ru: Тёмная
zh_hans: 深色
zh_hant: 深色

# 添加
source: Add
ja: 追加
ko: 추가
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# 添加 API Key
source: Add API key
ja: API Key を追加
ko: API Key 추가
ru: Добавить API Key
zh_hans: 添加 API Key
zh_hant: 新增 API Key

# 添加 WebMount 站点
source: Add WebMount site
ja: WebMountサイトを追加
ko: WebMount 사이트 추가
ru: Добавить сайт WebMount
zh_hans: 添加站点
zh_hant: 新增站點

# 添加外部工具服务器，连接后聊天可以使用服务器提供的工具。
source: Add an external tool server. Once connected, chat can use the tools it provides.
ja: 外部ツールサーバーを追加すると、チャットでサーバーのツールを利用できます。
ko: 외부 도구 서버를 추가하면 연결 후 채팅에서 서버가 제공하는 도구를 사용할 수 있습니다.
ru: Добавьте сервер внешних инструментов, чтобы после подключения чат мог использовать предоставляемые им инструменты.
zh_hans: 添加外部工具服务器，连接后聊天可以使用服务器提供的工具。
zh_hant: 新增外部工具伺服器，連線後聊天可使用伺服器提供的工具。

# 添加席位
source: Add seat
ja: 議席を追加
ko: 좌석 추가
ru: Добавить участника
zh_hans: 添加席位
zh_hant: 新增席位

# 添加服务商
source: Add provider
ja: プロバイダーを追加
ko: 서비스 제공업체 추가
ru: Добавить поставщика
zh_hans: 添加服务商
zh_hant: 新增服務提供者

# 添加模型
source: Add model
ja: モデルを追加
ko: 모델 추가
ru: Добавить модель
zh_hans: 添加模型
zh_hant: 新增模型

# 添加站点
source: Add site
ja: サイトを追加
ko: 사이트 추가
ru: Добавить сайт
zh_hans: 添加站点
zh_hant: 新增站點

# 添加请求头
source: Add request header
ja: リクエストヘッダーを追加
ko: 요청 헤더 추가
ru: Добавить заголовок запроса
zh_hans: 添加请求头
zh_hant: 新增要求標頭

# 添加附件
source: Add attachment
ja: 添付ファイルを追加
ko: 첨부 파일 추가
ru: Добавить вложение
zh_hans: 添加附件
zh_hant: 新增附件

# 清理
source: Clean up
ja: 整理
ko: 정리
ru: Очистить
zh_hans: 清理
zh_hant: 清理

# 清空搜索
source: Clear search
ja: 検索をクリア
ko: 검색어 지우기
ru: Очистить поиск
zh_hans: 清空搜索
zh_hant: 清空搜尋

# 清除
source: Clear
ja: 消去
ko: 지우기
ru: Очистить
zh_hans: 清除
zh_hant: 清除

# 清除 WebMount Session
source: Clear WebMount Session
ja: WebMount Session を消去
ko: WebMount Session 지우기
ru: Очистить WebMount Session
zh_hans: 清除站点会话
zh_hant: 清除站點工作階段

# 清除写入审批记录？
source: Clear write approval history?
ja: 書き込み承認履歴を消去しますか？
ko: 쓰기 승인 기록을 지울까요?
ru: Очистить записи согласований действий модели?
zh_hans: 清除写入审批记录？
zh_hant: 清除寫入核准記錄？

# 清除后要重新写好并确认，才能继续代笔写整章。
source: After clearing the plan, rewrite and confirm it before you can continue ghostwriting the full chapter.
ja: 消去後は、もう一度書き直して確認しないと、章全体の代筆を続けられません。
ko: 삭제한 후 다시 작성하고 확인해야 장 전체 대필을 계속할 수 있습니다.
ru: После очистки нужно заново написать и подтвердить план, чтобы продолжить написание всей главы.
zh_hans: 清除后要重新写好并确认，才能继续代笔写整章。
zh_hant: 清除後必須重新撰寫並確認，才能繼續代筆撰寫整章。

# 清除后，写整章时就不再参考这些备注。
source: After clearing, these notes won't be referenced when writing the full chapter.
ja: 消去すると、章全体を書く際にこれらのメモを参照しなくなります。
ko: 삭제하면 장 전체를 작성할 때 이 메모를 더 이상 참고하지 않습니다.
ru: После очистки эти заметки больше не будут учитываться при написании всей главы.
zh_hans: 清除后，写整章时就不再参考这些备注。
zh_hant: 清除後，撰寫整章時就不會再參考這些備註。

# 清除备注
source: Clear note
ja: メモを消去
ko: 메모 지우기
ru: Удалить заметки
zh_hans: 清除备注
zh_hant: 清除備註

# 清除审批记录
source: Clear approval records
ja: 承認履歴を消去
ko: 승인 기록 삭제
ru: Очистить записи согласований
zh_hans: 清除审批记录
zh_hant: 清除核准記錄

# 清除往后几章的备注？
source: Clear notes for later chapters?
ja: この先の章のメモを消去しますか？
ko: 이후 장의 메모를 지울까요?
ru: Удалить заметки в следующих главах?
zh_hans: 清除往后几章的备注？
zh_hant: 清除後續幾章的備註？

# 清除搜索
source: Clear search
ja: 検索条件を消去
ko: 검색 지우기
ru: Очистить поиск
zh_hans: 清除搜索
zh_hant: 清除搜尋

# 清除本站登录状态
source: Clear site sign-in
ja: このサイトのログイン状態を消去
ko: 이 사이트의 로그인 상태 지우기
ru: Очистить данные входа на этом сайте
zh_hans: 清除本站登录状态
zh_hant: 清除此網站的登入狀態

# 清除本章计划？
source: Clear this chapter's plan?
ja: この章の計画を消去しますか？
ko: 이 장의 계획을 지울까요?
ru: Удалить план этой главы?
zh_hans: 清除本章计划？
zh_hant: 清除本章計畫？

# 清除计划
source: Clear plan
ja: 計画を消去
ko: 계획 지우기
ru: Удалить план
zh_hans: 清除计划
zh_hant: 清除計畫

# 清除记录
source: Clear history
ja: 履歴を消去
ko: 기록 지우기
ru: Удалить записи
zh_hans: 清除记录
zh_hant: 清除記錄

# 游戏
source: Game
ja: ゲーム
ko: 게임
ru: Игра
zh_hans: 游戏
zh_hant: 遊戲

# 源码与日志
source: Source & logs
ja: ソースコードとログ
ko: 소스 코드 및 로그
ru: Исходный код и журналы
zh_hans: 源码与日志
zh_hant: 原始碼與日誌

# 源章节版本已经变化
source: The source chapter version has changed
ja: 元の章のバージョンが変わりました
ko: 원본 장 버전이 변경되었습니다.
ru: Версия исходной главы изменилась
zh_hans: 源章节版本已经变化
zh_hant: 來源章節版本已變更

# 滚动
source: Scroll
ja: スクロール
ko: 스크롤
ru: Прокрутка
zh_hans: 滚动
zh_hant: 捲動

# 灵魂
source: Soul
ja: 魂
ko: 영혼
ru: Душа
zh_hans: 灵魂
zh_hant: 靈魂

# 灵魂与记忆
source: Soul & memory
ja: 魂と記憶
ko: 영혼과 기억
ru: Душа и память
zh_hans: 灵魂与记忆
zh_hant: 靈魂與記憶

# 点击一项来申请系统权限或打开系统选择器。Amber 只能通过这些入口访问数据，不能绕过 iOS 授权。
source: Tap an item to request system permission or open a system picker. Amber can access data only through these entry points and can't bypass iOS authorization.
ja: 項目をタップしてシステムの許可を求めるか、システムセレクタを開きます。Amber がデータにアクセスできるのはこれらの入口経由のみで、iOS の許可を迂回することはできません。
ko: 항목을 탭해 시스템 권한을 요청하거나 시스템 선택기를 엽니다. Amber는 이 진입점을 통해서만 데이터에 접근하며 iOS 권한을 우회할 수 없습니다.
ru: Нажмите пункт, чтобы запросить системное разрешение или открыть системный диалог выбора. Amber может получать доступ к данным только через эти точки входа и не может обойти разрешения iOS.
zh_hans: 点击一项来申请系统权限或打开系统选择器。Amber 只能通过这些入口访问数据，不能绕过 iOS 授权。
zh_hant: 點選一項來申請系統權限或開啟系統選擇器。Amber 只能透過這些入口存取資料，不能繞過 iOS 授權。

# 点击终端或按钮呼出键盘
source: Tap the terminal or a button to show the keyboard
ja: ターミナルまたはボタンをタップしてキーボードを表示
ko: 터미널이나 버튼을 탭해 키보드 열기
ru: Нажмите на терминал или кнопку, чтобы открыть клавиатуру
zh_hans: 点击终端或按钮调出键盘
zh_hant: 點選終端機或按鈕叫出鍵盤

# 点右上角添加技能，或在下方重新扫描本机目录。
source: Tap the top-right button to add a skill, or rescan local directories below.
ja: 右上の追加ボタンをタップしてスキルを追加するか、下のボタンからこのデバイスのフォルダを再スキャンしてください。
ko: 오른쪽 상단에서 스킬을 추가하거나 아래에서 이 기기의 디렉터리를 다시 스캔하세요.
ru: Нажмите «+» в правом верхнем углу, чтобы добавить навык, или повторно просканируйте локальный каталог ниже.
zh_hans: 点右上角添加技能，或在下方重新扫描本机目录。
zh_hant: 點選右上角新增技能，或在下方重新掃描本機目錄。

# 点按切换预览与代码
source: Tap to switch between preview and code
ja: タップしてプレビューとコードを切り替え
ko: 탭하여 미리보기와 코드 전환
ru: Нажмите, чтобы переключить предпросмотр и код
zh_hans: 点按切换预览与代码
zh_hant: 點按切換預覽與程式碼

# 点按头像换照片，点按昵称可修改
source: Tap the avatar to change the photo; tap the nickname to edit it
ja: アバターをタップして写真を変更し、ニックネームをタップして編集
ko: 프로필 사진을 탭해 사진을 바꾸고, 닉네임을 탭해 수정하세요
ru: Нажмите на аватар, чтобы сменить фото; нажмите на псевдоним, чтобы изменить его
zh_hans: 点按头像换照片，点按昵称可修改
zh_hant: 點選頭像更換照片，點選暱稱即可修改

# 热度 %@
source: Popularity %@
ja: 人気度 %@
ko: 인기도 %@
ru: Популярность: %@
zh_hans: 热度 %@
zh_hant: 熱度 %@

# 热榜主题
source: Trending topics
ja: トレンドテーマ
ko: 인기 주제
ru: Популярные темы
zh_hans: 热榜主题
zh_hant: 熱榜主題

# 热榜及各类榜单中的非中文标题，抓取时即时翻译成通顺中文（专业术语保留原文）。
source: When fetched, non-Chinese titles in trending and other lists are translated into natural Chinese (technical terms stay in the original language).
ja: トレンドや各種ランキングにある中国語以外のタイトルを、取得時に自然な中国語へ即時翻訳します（専門用語は原文のまま）。
ko: 인기 순위와 각종 목록의 중국어가 아닌 제목을 가져올 때 자연스러운 중국어로 즉시 번역합니다(전문 용어는 원문 유지).
ru: Заголовки на других языках в трендах и списках, при загрузке переводятся на естественный китайский (профессиональные термины сохраняются в оригинале).
zh_hans: 热榜及各类榜单中的非中文标题，抓取时即时翻译成通顺中文（专业术语保留原文）。
zh_hant: 熱門榜單及各類榜單中的非中文標題，擷取時即時翻譯成通順中文（專業術語保留原文）。

# 热榜来源 · %@
source: Trending source · %@
ja: ランキングの出典 · %@
ko: 인기 차트 출처 · %@
ru: Источник топа · %@
zh_hans: 热榜来源 · %@
zh_hant: 熱門榜來源 · %@

# 照片
source: Photos
ja: 写真
ko: 사진
ru: Фото
zh_hans: 照片
zh_hant: 照片

# 版式
source: Layout
ja: レイアウト
ko: 레이아웃
ru: Макет
zh_hans: 版式
zh_hant: 版面

# 版本
source: Version
ja: バージョン
ko: 버전
ru: Версия
zh_hans: 版本
zh_hant: 版本

# 版本 %@ · %@
source: Version %@ · %@
ja: バージョン %@ · %@
ko: 버전 %@ · %@
ru: Версия %@ · %@
zh_hans: 版本 %@ · %@
zh_hant: 版本 %@ · %@

# 版本 %lld · %@
source: Version %1$lld · %2$@
ja: バージョン %1$lld · %2$@
ko: 버전 %1$lld · %2$@
ru: Версия %1$lld · %2$@
zh_hans: 版本 %1$lld · %2$@
zh_hant: 版本 %1$lld · %2$@

# 版本历史
source: Version history
ja: バージョン履歴
ko: 버전 기록
ru: История версий
zh_hans: 版本历史
zh_hant: 版本歷史

# 版本恢复
source: Restore version
ja: バージョンを復元
ko: 버전 복원
ru: Восстановление версии
zh_hans: 版本恢复
zh_hant: 版本恢復

# 状态
source: Status
ja: 状態
ko: 상태
ru: Статус
zh_hans: 状态
zh_hant: 狀態

# 状态冲突
source: State conflict
ja: 状態の競合
ko: 상태 충돌
ru: Конфликт состояния
zh_hans: 状态冲突
zh_hant: 狀態衝突

# 状态过期
source: Status expired
ja: 状態の有効期限切れ
ko: 상태 만료
ru: Состояние устарело
zh_hans: 状态过期
zh_hant: 狀態已過期

# 状态，%@
source: Status, %@
ja: 状態：%@
ko: 상태, %@
ru: Статус, %@
zh_hans: 状态，%@
zh_hant: 狀態，%@

# 状态：%@
source: Status: %@
ja: 状態：%@
ko: 상태: %@
ru: Статус: %@
zh_hans: 状态：%@
zh_hant: 狀態：%@

# 环境配置
source: Environment configuration
ja: 環境設定
ko: 환경 구성
ru: Конфигурация среды
zh_hans: 环境配置
zh_hant: 環境設定

# 现有记忆无法读取
source: Couldn't read existing memories
ja: 既存のメモリを読み込めません
ko: 기존 기억을 읽을 수 없습니다
ru: Не удалось прочитать существующую память
zh_hans: 现有记忆无法读取
zh_hant: 現有記憶無法讀取

# 生成
source: Generate
ja: 生成
ko: 생성
ru: Сгенерировать
zh_hans: 生成
zh_hant: 產生

# 生成中
source: Generating
ja: 生成中
ko: 생성 중
ru: Генерация…
zh_hans: 生成中
zh_hant: 產生中

# 生成中，暂不可修改图片
source: Generating; image editing is temporarily unavailable
ja: 生成中のため、画像を変更できません
ko: 생성 중이며 이미지를 수정할 수 없습니다
ru: Идёт генерация, изображение пока нельзя изменить
zh_hans: 生成中，暂时无法修改图片
zh_hant: 產生中，暫時無法修改圖片

# 生成在输出内容前已中断
source: Generation was interrupted before any output
ja: 出力前に生成が中断されました
ko: 출력 내용을 내기 전에 생성이 중단되었습니다.
ru: Генерация прервана до вывода содержимого
zh_hans: 生成在输出内容前已中断
zh_hant: 產生作業在輸出內容前已中斷

# 生成失败 · 已保留草稿，正文与剧情状态未改变
source: Generation failed · Draft kept; manuscript and plot state unchanged
ja: 生成失敗 · 下書きを保持し、本文とストーリー状態は変更されていません
ko: 생성 실패 · 초안을 보존했으며 본문과 스토리 상태는 변경되지 않았습니다
ru: Генерация не удалась · черновик сохранён, текст и состояние сюжета не изменились
zh_hans: 生成失败 · 已保留草稿，正文与剧情状态未改变
zh_hant: 產生失敗 · 已保留草稿，正文與劇情狀態未改變

# 生成失败 · 正文与剧情状态未改变
source: Generation failed · Manuscript and plot state unchanged
ja: 生成失敗 · 本文とストーリー状態は変更されていません
ko: 생성 실패 · 본문과 스토리 상태는 변경되지 않았습니다
ru: Генерация не удалась · текст и состояние сюжета не изменились
zh_hans: 生成失败 · 正文与剧情状态未改变
zh_hant: 產生失敗 · 正文與劇情狀態未改變

# 生成失败，未输出正文
source: Generation failed; no manuscript output
ja: 生成に失敗し、本文は出力されませんでした
ko: 생성 실패, 본문이 출력되지 않았습니다.
ru: Генерация не удалась, основной текст не выведен
zh_hans: 生成失败，未输出正文
zh_hant: 產生失敗，未輸出正文

# 生成已中断
source: Generation interrupted
ja: 生成が中断されました
ko: 생성이 중단되었습니다
ru: Генерация прервана
zh_hans: 生成已中断
zh_hant: 產生已中斷

# 生成已中断 · 可收录已生成部分
source: Generation interrupted · You can adopt the generated portion
ja: 生成が中断されました · 生成済み部分を収録できます
ko: 생성이 중단되었습니다 · 생성된 부분은 수록할 수 있습니다
ru: Генерация прервана · сгенерированную часть можно добавить
zh_hans: 生成已中断 · 可收录已生成部分
zh_hant: 產生已中斷 · 可收錄已產生部分

# 生成建议
source: Generate suggestion
ja: 生成提案
ko: 생성 제안
ru: Сгенерировать рекомендации
zh_hans: 生成建议
zh_hant: 產生建議

# 生成意图
source: Generation intent
ja: 生成意図
ko: 생성 의도
ru: Цель генерации
zh_hans: 生成意图
zh_hant: 產生意圖

# 生成整章
source: Generate full chapter
ja: 章全体を生成
ko: 장 전체 생성
ru: Сгенерировать всю главу
zh_hans: 生成整章
zh_hant: 產生整章

# 生成未完成
source: Generation incomplete
ja: 生成未完了
ko: 생성 미완료
ru: Генерация не завершена
zh_hans: 生成未完成
zh_hant: 產生未完成

# 生成未完成 · 可重试
source: Generation incomplete · Retry available
ja: 生成未完了 · 再試行可能
ko: 생성 미완료 · 다시 시도할 수 있음
ru: Генерация не завершена · можно повторить
zh_hans: 生成未完成 · 可重试
zh_hant: 產生未完成 · 可重試

# 生成未完成，部分内容可能不完整。点右上角重试。
source: Generation incomplete; some content may be incomplete. Tap the retry button in the top-right.
ja: 生成が未完了で、一部の内容が不完全な可能性があります。右上の再試行をタップしてください。
ko: 생성이 완료되지 않아 일부 내용이 불완전할 수 있습니다. 오른쪽 위에서 다시 시도하세요.
ru: Генерация не завершена, часть содержимого может отсутствовать. Нажмите повторить в правом верхнем углу.
zh_hans: 生成未完成，部分内容可能不完整。点右上角重试。
zh_hant: 產生未完成，部分內容可能不完整。點右上角重試。

# 生成结束后才能导出项目包；正文和工作区仍可导出。
source: The project package can be exported only after generation finishes; the manuscript and workspace can still be exported.
ja: 生成が完了してからプロジェクトパッケージをエクスポートできます。本文とワークスペースは引き続きエクスポートできます。
ko: 생성이 끝난 후에만 프로젝트 패키지를 내보낼 수 있습니다. 본문과 작업 공간은 계속 내보낼 수 있습니다.
ru: Пакет проекта можно экспортировать только после завершения генерации; текст и Workspace можно экспортировать и раньше.
zh_hans: 生成结束后才能导出项目包；正文和工作区仍可导出。
zh_hant: 產生結束後才能匯出專案套件；正文和工作區仍可匯出。

# 用 ChatGPT 账号登录
source: Sign in with ChatGPT
ja: ChatGPT アカウントでログイン
ko: ChatGPT 계정으로 로그인
ru: Войти с учётной записью ChatGPT
zh_hans: 用 ChatGPT 账号登录
zh_hant: 使用 ChatGPT 帳號登入

# 用 Google 账号登录 Antigravity
source: Sign in to Antigravity with Google
ja: Google アカウントで Antigravity にログイン
ko: Google 계정으로 Antigravity에 로그인
ru: Войти в Antigravity с учётной записью Google
zh_hans: 用 Google 账号登录 Antigravity
zh_hant: 使用 Google 帳號登入 Antigravity

# 用 Grok 账号登录
source: Sign in with Grok
ja: Grok アカウントでログイン
ko: Grok 계정으로 로그인
ru: Войти с учётной записью Grok
zh_hans: 用 Grok 账号登录
zh_hant: 使用 Grok 帳號登入

# 用于录音、语音输入或音视频采集
source: Used for audio recording, voice input, or audio/video capture
ja: 録音、音声入力、または音声・動画の収録に使用します。
ko: 녹음, 음성 입력 또는 오디오·비디오 캡처에 사용됩니다.
ru: Для записи звука, голосового ввода и захвата аудио/видео
zh_hans: 用于录音、语音输入或音视频采集
zh_hant: 用於錄音、語音輸入或影音擷取

# 用于拍照、摄像、扫描或视觉输入
source: Used for photos, video, scanning, or visual input
ja: 写真撮影、動画撮影、スキャン、または視覚入力に使用します。
ko: 사진 촬영, 동영상 촬영, 스캔 또는 시각 입력에 사용됩니다.
ru: Для фото, видео, сканирования и визуального ввода
zh_hans: 用于拍照、摄像、扫描或视觉输入
zh_hant: 用於拍照、錄影、掃描或視覺輸入

# 用当前语速朗读一段中文测试文本
source: Read a Chinese test passage at the current speed
ja: 現在の読み上げ速度で中国語のテスト文を読み上げ
ko: 현재 속도로 중국어 테스트 문장 읽기
ru: Прочитать тестовый текст на китайском с текущей скоростью
zh_hans: 用当前语速朗读一段中文测试文本
zh_hant: 用目前語速朗讀一段中文測試文字
